/*
? У змінній minutes лежить число від 0 до 59.
? Визначте, в яку чверть години потрапляє це число (у першу, другу, третю чи четверту).
? [0 до 15) - перша чверть години
? [15 до 30) - друга чверть години
? [30 до 45) - третя чверть години
? [45 до 60) - четверта чверть години
*/

// const minutes = 70;
// let message;

// if (minutes >= 0 && minutes < 15) {
// 	message = `first 0-15`;
// } else if (minutes >= 15 && minutes < 30) {
// 	message = `second 15-30`;
// } else if (minutes >= 30 && minutes < 45) {
// 	message = `third 30-45`;
// } else if (minutes >= 45 && minutes < 60) {
// 	message = `forth 45-60`;
// } else { message = `not a hour`; };

// console.log(message);

// =============================================================================================================================
// =============================================================================================================================

/*
?  Перепишіть код за допомогою однієї конструкції switch:
*/

// const number = Number(prompt('Введіть число між 0 та 3'));

// if (number === 0) {
//   console.log('Ви ввели число 0');
// } else if (number === 1) {
//   console.log('Ви ввели число 1');
// } else if (number === 2 || number === 3) {
//   console.log('Ви ввели число 2, а може й 3');
// } else {
//   console.log('Ви ввели якесь інше число');
// }


// const number = Number(prompt('Введіть число між 0 та 3'));

// switch (number) {
// 	case 0: console.log('Ви ввели число 0');
// 		break;
// 	case 1: console.log('Ви ввели число 1');
// 		break;
// 	case 2:
// 	case 3: console.log('Ви ввели число 2, може й 3');
// 		break;
// 	default: console.log('Ви ввели якесь інше число');
// }


// =============================================================================================================================
// =============================================================================================================================


/*
? Напиши скрипт, який перевіряє можливість відкрити чат з користувачем.
? Для цього, користувач має бути:
? - другом
? - онлайн
? - без режима не турбувати
 */

// const isOnline = true;
// const isFriend = true;
// const isDnd = false;

// let canOpenChat = isOnline && isFriend && !isDnd;

// console.log('Чи можна відкрити чат? ', canOpenChat);

// =============================================================================================================================
// =============================================================================================================================

/*
? Напиши скрипт перевірки підписки користувача при доступі до контента
? - Є три типа підписки: free, pro і vip.
? - Отримати доступ можуть тільки користувачі pro і vip
 */

// const sub = 'free';
// let canAccessContent = sub.includes('pro') || sub.includes('vip');

// console.log('Чи є доступ до контенту?', canAccessContent);


// =============================================================================================================================
// =============================================================================================================================


// Функція createReversedArray() може приймати довільну кількість аргументів.Доповни код функції так, щоб вона повертала масив усіх аргументів,
// 	але в масиві вони повинні йти у зворотному порядку.Тобто, при виклику createReversedArray(1, 2, 3), функція має повернути масив[3, 2, 1].Використовуй цикл або метод масиву toReversed(),
// 		який застосовується до масиву і результатом роботи повертає новий масив з елементами у зворотньому порядку.

// Оголошена функція createReversedArray()
// Виклик функції createReversedArray(12, 85, 37, 4) повертає [4, 37, 85, 12]
// Виклик функції createReversedArray(164, 48, 291) повертає [291, 48, 164]
// Виклик функції createReversedArray(412, 371, 94, 63, 176) повертає [176, 63, 94, 371, 412]
// Виклик функції createReversedArray() повертає []

// function createReversedArray() {

// 	const argArray = Array.from(arguments);
	
// 	let revArray = [];

// 	for (let i = argArray.length - 1; i >= 0; i--) {
// 		revArray.push(argArray[i]);
// 	}
	
// 	return revArray;

// }

// console.log(createReversedArray(12, 85, 37, 4));


//  =============================================================================================================================
//  =============================================================================================================================

/*
? Напиши скрипт для обчислення площі прямокутника зі сторонами,
? значення яких зберігаються у змінній values у вигляді рядка.
? Значення гарантовано розділені пробілом.
 */

// const values = '8 11';
// const rectSides = values.split(' ');
// const rectArea = +rectSides[0] * +rectSides[1];

// console.log('values:', values);
// console.log('rectSides:', rectSides);
// console.log('rectArea:', rectArea);

//  =============================================================================================================================
//  =============================================================================================================================

/*
? Напиши скрипт, який підраховує суму всіх парних чисел у масиві.
*/

// const numbers = [1, 5, 8, 9, 12, 4];
// let total = 0;

// console.log('numbers: ', numbers);

// for (const number of numbers) {
// 	if (number % 2 === 0) {
// 		console.log('Парне:', number);
// 		total += number;
// 	}
// }

// console.log('total: ', total);

// TODO =============================================================================================================================
// TODO =============================================================================================================================

/*
? Напиши скрипт, який виводить у консоль ім'я та телефонний номер користувача.
? У змінних names та phones зберігаються рядки імен та телефонних номерів,
? розділені комами. Порядковий номер імен та телефонів у рядках вказують на
? відповідність. Кількість імен та телефонів гарантовано однакова.
*/

// const names = 'Jacob,William,Solomon,Artemis';
// const phones = '89001234567,89001112233,890055566377,890055566300';

// const namesArray = names.split(',');
// console.log(namesArray);
// const phonesArray = phones.split(',');
// console.log(phonesArray);

// const index = prompt('Enter index') - 1;
// console.log(namesArray[index], phonesArray[index]);


/*
? Напиши скрипт, який виводить у консоль усі слова рядка крім першого і останнього.
*/

// const string = 'Our office is closed so we`re working from home today.';
// console.log(string);

// const stringArr = string.split(' ');
// console.log(stringArr);

// const newString = `${stringArr.slice(1, stringArr.length - 1).join(' ')}`;

// console.log(newString);



/*
? Напиши скрипт пошуку найменшого числа у масиві. Код повинен працювати
? для будь-якого масиву чисел. Використовуй цикл для розв'язання задачі.
*/

// const values = [17, -10, 94, -30, 1, 23, -20];
// let min = 0;

// console.log(min);

/*
? У нас є декілько масивів із зарплатами працівників із різних відділів, потрібно порахувати загальну суму зарплат
*/

// const managerSalaries = [100, 150, 250, 400, 500];
// const developersSalaries = [800, 1500, 4000];
// let total = 0;